{
    "context1": "Doctor: Good morning! Please have a seat. What brings you in today?\n\nPatient: Good morning, doctor. I've been having irregular periods, and I sometimes feel lower abdominal pain. It's been happening for the past few months.\n\nDoctor: I see. Have you noticed any other symptoms, like heavy bleeding, fatigue, or mood changes?\n\nPatient: Yes, sometimes the bleeding is heavier than usual, and I feel very tired. My mood has also been a bit unstable.\n\nDoctor: Understood. Irregular periods can have many causes, including hormonal imbalances, stress, or underlying conditions like PCOS. Have you had any medical tests recently?\n\nPatient: No, I haven't had any tests yet.\n\nDoctor: Alright. I'd like to conduct a physical examination today and also recommend some tests, including an ultrasound and hormone level tests, to better understand what's going on.\n\nPatient: That sounds good.\n\nDoctor: Based on the test results, we can decide the best course of treatment. I'd like you to come back in a few days with the reports so we can discuss them in detail. In the meantime, try to maintain a healthy diet and reduce stress as much as possible.\n\nPatient: Okay, doctor. So, I'll return in a few days with the test results?\n\nDoctor: Yes. I would like to schedule an appoitment for you with a gynecologist. If you experience severe pain or any unusual symptoms before then, don't hesitate to call us.\n\nPatient: Okay thank you, doctor.\n\nDoctor: You're welcome. Take care, and see you soon!",
    "context2": "Doctor: Good morning! What brings you in today?\n\nPatient: Good morning, doctor. I've been having persistent lower back pain for the past few weeks. It's worse in the morning and sometimes spreads to my legs.\n\nDoctor: I see. Have you experienced any numbness, tingling, or weakness in your legs?\n\nPatient: Yes, sometimes my left leg feels a bit numb, especially after sitting for too long.\n\nDoctor: That could indicate a nerve-related issue or a spinal problem. While I can do a preliminary assessment, I recommend that you see an orthopedic specialist for a detailed evaluation. They can check for conditions like a herniated disc or sciatica.\n\nPatient: That makes sense. Should I get any tests done before seeing the specialist?\n\nDoctor: I'll prescribe an X-ray of your lower back. Depending on the results, the orthopedic doctor may request an MRI if needed.\n\nPatient: Alright. When can I see the orthopedic doctor?\n\nDoctor: I would have to confirm and let you know.\n\nPatient: Thank you, doctor. I'll get the X-ray done.\n\nDoctor: That's a good plan. Take care, and if the pain worsens before your appointment, don't hesitate to call us.\n\nPatient: I appreciate it. See you soon!",
    "context3": "Doctor: Good morning! How can I help you today?\n\nPatient: Good morning, doctor. I've been having frequent headaches for the past few weeks. Sometimes, they're really intense and accompanied by dizziness.\n\nDoctor: I see. Do you also experience nausea, vision problems, or sensitivity to light?\n\nPatient: Yes, sometimes bright lights make it worse, and I feel a little nauseous.\n\nDoctor: That sounds like it could be migraines, but we need to rule out other possible causes, such as sinus issues or high blood pressure. Have you noticed any specific triggers, like stress or certain foods?\n\nPatient: I think stress makes it worse, but I'm not sure about food.\n\nDoctor: Alright. I'd like to run a few tests, including a blood pressure check and possibly a sinus X-ray. I also recommend that you see a neurologist for a more detailed assessment. They can determine whether these headaches are migraines or related to another condition.\n\nPatient: That makes sense. How do I book an appointment with the neurologist?\n\nDoctor: You can schedule an appointment at the reception before you leave. They'll check the doctor's availability and arrange a suitable time for you.\n\nPatient: Alright, I'll do that. Thank you, doctor.\n\nDoctor: You're welcome. In the meantime, try to stay hydrated, get enough rest, and avoid stress as much as possible. Let me know if the headaches become more severe.\n\nPatient: I will. Thanks again!"
}